from random import *

run = True

koloda = ["2 Пики", "3 Пики", "4 Пики", "5 Пики", "6 Пики", "7 Пики", "8 Пики", "9 Пики", "10 Пики", "j Пики", "q Пики", "k Пики", "a Пики",
          "2 Буби", "3 Буби", "4 Буби", "5 Буби", "6 Буби", "7 Буби", "8 Буби", "9 Буби", "10 Буби", "j Буби", "q Буби", "k Буби", "a Буби",
          "2 Крести", "3 Крести", "4 Крести", "5 Крести", "6 Крести", "7 Крести", "8 Крести", "9 Крести", "10 Крести", "j Крести", "q Крести", "k Крести", "a Крести",
          " Черви", "3 Черви", "4 Черви", "5 Черви", "6 Черви", "7 Черви", "8 Черви", "9 Черви", "10 Черви", "j Черви", "q Черви", "k Черви", "a Черви"]
balance = 1000

while run:
    if balance > 0:
        shuffle(koloda)
        print(f"У вас на счету: {balance}$")
        stavka = abs(int(input("Введите ставку: ")))
        if stavka > balance:
            print("не хватает баланса")
        else:
            balance -= stavka
            print("У вас на руках карты: ")
            print(koloda[-1])
            koloda.pop(-1)
            print(koloda[-1])
            koloda.pop(-1)
            choice = input("Хотите взять еще карту?(да/нет): ")
    else:
        print("Деньги кончились.")
        run = False